Revit.GeometryReferences.ElementGeometryReference
A base class for revit Reference objects

Revit.GeometryReferences.ElementGeometryReference.InternalReference
A stable reference to a Revit Element's geometry